AUTO_config_TK_pesok/src/Catalogs/ПрофилиКассиров/ПрофилиКассиров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиКассиров</name>
  <tabularSections>
    <name>НастройкаПравКассира</name>
    <comment>Хранит данные о настройках прав кассира для различных POS терминалов, отличные от значений по умолчанию</comment>
    <attributes>
      <name>МодельPOS</name>
      <comment>Модель POS</comment>
      <type>
        <types>EnumRef.МоделиСерверовPOSТерминалов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПрава</name>
      <comment>Идентификатор права</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разрешено</name>
      <comment>Признак того, что право разрешено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Enums/МоделиСерверовPOSТерминалов/МоделиСерверовPOSТерминалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МоделиСерверовPOSТерминалов</name>
  <comment>Модели серверов POS терминалов</comment>
  <enumValues>
    <name>КассовыйСерверХамелеон</name>
  </enumValues>
  <enumValues>
    <name>КассовыйСерверОпенстор</name>
  </enumValues>
  <enumValues>
    <name>КристаллSet</name>
    <comment>Кристалл-Set</comment>
  </enumValues>
  <enumValues>
    <name>ПрофитТ</name>
    <comment>Профит-Т</comment>
  </enumValues>
  <enumValues>
    <name>СупермагУКМ40</name>
    <comment>Супермаг-УКМ 4.0</comment>
  </enumValues>
  <enumValues>
    <name>СупермагУКМ</name>
    <comment>Супермаг-УКМ</comment>
  </enumValues>
  <enumValues>
    <name>КассовыйСерверРарус</name>
    <comment>Кассовый сервер &quot;Рарус&quot;</comment>
  </enumValues>
  <enumValues>
    <name>POSЭксперт</name>
    <comment>POS Эксперт-Linux</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/ПрофилиКассиров/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МодельPOS = ПредопределенноеЗначение("Перечисление.МоделиСерверовPOSТерминалов.КассовыйСерверОпенстор");
	
	ЗаполнитьПраваКассира();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПраваКассира(ТекущийОбъект);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти


#Область ОбработчикиКомандФормы


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПраваКассира()
	
	ТаблицаПравПоУмолчанию = ТаблицаПравКассира.Выгрузить();
	ТаблицаПравПоУмолчанию.Очистить();
	
	Макет = Справочники.ПрофилиКассиров.ПолучитьМакет("ТД_MXL_КассовыйСерверОпенстор");
	ОбластьПрава = Макет.ПолучитьОбласть("Права");
	
	Для стр = 1 По ОбластьПрава.ВысотаТаблицы Цикл 
		НоваяСтрока = ТаблицаПравПоУмолчанию.Добавить();
		НоваяСтрока.ИдентификаторПрава = Число(ОбластьПрава.Область(стр, 1).Текст);
		НоваяСтрока.Право = ОбластьПрава.Область(стр, 2).Текст;
		НоваяСтрока.Разрешено = СокрЛП(НРег(ОбластьПрава.Область(стр, 3).Текст)) = "истина";
		НоваяСтрока.МодельPOS = МодельPOS;
	КонецЦикла;
	
	Если Объект.НастройкаПравКассира.Количество() > 0 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПраваПоУмолчанию.ИдентификаторПрава КАК ИдентификаторПрава,
		               |	ПраваПоУмолчанию.Разрешено КАК Разрешено,
		               |	ПраваПоУмолчанию.Право КАК Право,
		               |	ПраваПоУмолчанию.МодельPOS КАК МодельPOS
		               |ПОМЕСТИТЬ ПраваПоУмолчанию
		               |ИЗ
		               |	&ПраваПоУмолчанию КАК ПраваПоУмолчанию
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Права.ИдентификаторПрава КАК ИдентификаторПрава,
		               |	Права.Разрешено КАК Разрешено,
		               |	Права.МодельPOS КАК МодельPOS
		               |ПОМЕСТИТЬ Права
		               |ИЗ
		               |	&Права КАК Права
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПраваПоУмолчанию.ИдентификаторПрава КАК ИдентификаторПрава,
		               |	ВЫБОР
		               |		КОГДА НЕ Права.Разрешено ЕСТЬ NULL
		               |			ТОГДА Права.Разрешено
		               |		ИНАЧЕ ПраваПоУмолчанию.Разрешено
		               |	КОНЕЦ КАК Разрешено,
		               |	ПраваПоУмолчанию.Право КАК Право,
		               |	ПраваПоУмолчанию.МодельPOS КАК МодельPOS
		               |ИЗ
		               |	ПраваПоУмолчанию КАК ПраваПоУмолчанию
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Права КАК Права
		               |		ПО ПраваПоУмолчанию.МодельPOS = Права.МодельPOS
		               |			И ПраваПоУмолчанию.ИдентификаторПрава = Права.ИдентификаторПрава";
		
		Запрос.УстановитьПараметр("ПраваПоУмолчанию", ТаблицаПравПоУмолчанию);
		Запрос.УстановитьПараметр("Права", Объект.НастройкаПравКассира.Выгрузить());
		
		ТаблицаПрав = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		ТаблицаПрав = ТаблицаПравПоУмолчанию;
		
	КонецЕсли;
	
	ТаблицаПравКассира.Загрузить(ТаблицаПрав);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПраваКассира(ТекОбъект)
	
	ТекОбъект.НастройкаПравКассира.Очистить();
	
	Для Каждого Стр Из ТаблицаПравКассира Цикл 
		НоваяСтрока = ТекОбъект.НастройкаПравКассира.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "МодельPOS, ИдентификаторПрава, Разрешено");
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти
